# Browsers
cask 'firefox'
#cask 'googl-chrome'

# Terminals
cask 'iterm2'
cask 'kitty'
brew 'tmux'

# Shells
brew 'bash'
brew 'bash-completion'
brew 'zsh'
cask 'ghostty'
# Editors
brew 'vim'
cask 'intellij-idea'
#cask 'macvim'
#cask 'emacs'
#cask 'sublime-text'
#cask 'android-studio'

# Download
brew 'curl'
brew 'wget'

# Version control
brew 'git'
brew 'gh'
brew 'tig'

# https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
# Basic file, shell and text manipulation utilities of the GNU operating system.
brew 'coreutils'

brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'
brew 'rg'
brew 'ag'

##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##
brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'gpatch'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'


# File compression/uncompression
brew 'zstd'
brew 'unzip'

# file synchronizer.
brew 'rsync'

# Text search
brew 'grep'
brew 'jq'

# Docker software containers to help distribute applications.
#brew 'docker'
#brew 'docker-machine'
#brew 'xhyve'
#brew 'docker-machine-driver-xhyve'
#cask 'osxfuse'
#brew 'sshfs'
brew 'colima'

## Uncategorized
brew 'base64'
cask 'slack'
cask 'zoom'
brew 'kubectl'
brew 'kubectx' 
brew 'boz/repo/kail'
brew 'dep'
brew 'repo'
brew 'npm'
brew 'nvm'
brew 'kube-ps1'
cask 'google-cloud-sdk'
brew "zplug"
brew "asdf"
cask "naisdevice"
brew "fzf"
brew "maven"
brew "bitwarden-cli"
